Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetSingleRebar Method
 Returns a single rebar inside the rebar group located by the given index. The indexing starts from the start point. The rebar represents a physical reinforcing bar and contains physical points in the 3D space of the bar. The method returns null on error, for example if given an erroneous index. The number of rebars in the group can be requested with GetNumberOfRebars().
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarGeometry GetSingleRebar(
	int index,
	bool withHooks
)
Public Function GetSingleRebar (
	index As Integer,
	withHooks As Boolean
) As RebarGeometry
Parameters
index
Type: System.Int32
The index of the rebar in the group.
withHooks
Type: System.Boolean
A parameter to determine whether the hook points should be included in the rebar geometry or not.
Return Value
Type: RebarGeometry
The instance of a RebarGeometry object that contains the point list of the single physical reinforcing bar. Null if the given index was not valid.
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace